### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [37]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_df= pd.read_csv(file_to_load)

In [38]:
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [39]:
#total player count
Total_Players = len(purchase_df["SN"].value_counts())
Total_Players_df= pd.DataFrame({"Total Players": Total_Players}, index=[0])
Total_Players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [40]:
# item list
distinct_items= len(purchase_df["Item ID"].unique())
distinct_items

179

In [41]:
#average price for whole data set
Average_Price=round(purchase_df["Price"].mean(),2)
Average_Price

3.05

In [42]:
# total purchases
Number_purchases=purchase_df["Purchase ID"].count()
Number_purchases

780

In [43]:
# total revenue reported in data set
Total_revenue=round(purchase_df["Price"].sum(),2)
Total_revenue

2379.77

In [44]:
# create summary table
purchase_analysis_df=pd.DataFrame({"Total Unique Items":[distinct_items],
                                    "Av. Purchase Price":[Average_Price],
                                    "Total Purchases":Number_purchases,
                                    "Total Revenue":Total_revenue})
# can also take square brackets off of first item and add , index[0] at the end but that works only if you want one line of data
purchase_analysis_df

   Total Unique Items  Av. Purchase Price  Total Purchases  Total Revenue
0                 179                3.05              780        2379.77

In [45]:
purchase_analysis_df["Av. Purchase Price"]=purchase_analysis_df["Av. Purchase Price"].map("${0:,.2f}".format)
purchase_analysis_df["Total Revenue"]=purchase_analysis_df["Total Revenue"].map("${0:,.2f}".format)
purchase_analysis_df

   Total Unique Items Av. Purchase Price  Total Purchases Total Revenue
0                 179              $3.05              780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [46]:
gender_df=purchase_df[['Gender', 'SN']]
gender_df.head()

  Gender             SN
0   Male        Lisim78
1   Male    Lisovynya38
2   Male     Ithergue48
3   Male  Chamassasya86
4   Male      Iskosia90

In [47]:
#test to make sure new DF has the correct # of rows
gender_df=gender_df.drop_duplicates()
total_count=gender_df['Gender'].count()
total_count

576

In [48]:

# Count= gender_df.groupby(["Gender"]).agg("count")
# Count

#this will get you the same results as above
gender=gender_df.groupby(["Gender"])
gender_group = gender.count()
gender_group

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [49]:
Percent = (gender_group/total_count)
Percent

                             SN
Gender
Female                 0.140625
Male                   0.840278
Other / Non-Disclosed  0.019097

In [50]:
#change header to what I want it to be
new_gender_df=gender_df.groupby(["Gender"]).agg("count").rename(columns={'SN':'Total Count'})

new_gender_df

                       Total Count
Gender
Female                          81
Male                           484
Other / Non-Disclosed           11

In [51]:
#trying to add a column to a group by - class example =https://ku.bootcampcontent.com/ku-coding-boot-camp/ku-virt-data-pt-01-2021-u-c/-/blob/master/01-Lesson-Plans/04-Pandas/3/Activities/04-Stu_TedTalks-Binning/Solved/BinningTed.Ben.ipynb
new_gender_df["Percent of Total"]= (gender_group/total_count)
new_gender_df

                       Total Count  Percent of Total
Gender
Female                          81          0.140625
Male                           484          0.840278
Other / Non-Disclosed           11          0.019097

In [52]:
#add percent to gender grouped DF
new_gender_df["Percent of Total"]=new_gender_df["Percent of Total"].map("{:.2%}".format)
new_gender_df

                       Total Count Percent of Total
Gender
Female                          81           14.06%
Male                           484           84.03%
Other / Non-Disclosed           11            1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [62]:
# rename headers- source https://stackoverflow.com/questions/44416287/renaming-columns-after-group-by-and-sum-in-pandas-dataframe/44416348
group_test=purchase_df.groupby(["Gender"]).agg(['count', np.mean, sum,])["Price"].rename(columns={'count':'Purchase Count','mean' : 'Average Purchase Price', 'sum': 'Total Purchase Value'})
group_test.head()

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [63]:
average_purchase_DF= purchase_df.groupby(["Gender", "SN"]).agg(sum)[["Price"]]
average_purchase_DF

                                     Price
Gender                SN
Female                Adastirin33     4.48
                      Aerithllora36   8.64
                      Aethedru70      3.54
                      Aidain51        3.45
                      Aiduesu86       4.48
...                                    ...
Other / Non-Disclosed Lirtim36        1.33
                      Maluncil97      5.28
                      Rairith81       2.22
                      Siarithria38    6.91
                      Sundim98        4.75

[576 rows x 1 columns]

In [64]:
average_purchase_SN = average_purchase_DF.groupby(["Gender"]).agg(np.mean)["Price"]
average_purchase_SN

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
Name: Price, dtype: float64

In [65]:
group_test["Avg Total Purchase per Person"]=average_purchase_SN
group_test["Avgerage Purchase Price"]=group_test["Average Purchase Price"].map("${0:,.2f}".format)
group_test["Total Purchase Value"]=group_test["Total Purchase Value"].map("${0:,.2f}".format)
group_test["Avg Total Purchase per Person"]=group_test["Avg Total Purchase per Person"].map("${0:,.2f}".format)
group_test

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person,Avgerage Purchase Price
Gender,,,,,
Female,113,3.203009,$361.94,$4.47,$3.20
Male,652,3.017853,"$1,967.64",$4.07,$3.02
Other / Non-Disclosed,15,3.346000,$50.19,$4.56,$3.35

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [ ]:
#this is not in the README

In [67]:
# create bins
age_bins = [0,9,14,19,24,29,34,39,90]
#create labels
age_labels = [">10","10-14", "15-19", "20-24","25-29", "30-34", "35-39", "40+"] 

print(len(age_bins))
print(len(age_labels))

9
8

In [68]:
purchase_df["Age Group"] = pd.cut(purchase_df["Age"], age_bins, labels=age_labels)
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [69]:
#group by age group
age_demographic_df=purchase_df[['Age Group','SN']]
gender_df=gender_df.drop_duplicates()   

age_demo_count_df=age_demographic_df.groupby("Age Group").agg('count')[["SN"]].rename(columns={'SN':'Total Count'})
age_demo_count_df

           Total Count
Age Group
>10                 23
10-14               28
15-19              136
20-24              365
25-29              101
30-34               73
35-39               41
40+                 13

In [71]:
age_demo=purchase_df.groupby("Age Group")

In [73]:
distinct_SN=age_demo["SN"].nunique()
distinct_SN

Age Group
>10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [74]:
# age_demo_percent= (distinct_SN/Total_Players)*100
# age_demo_percent

In [75]:
age_demo_count_df["Percentage of Players"]= (distinct_SN/Total_Players)
age_demo_count_df["Percentage of Players"]=age_demo_count_df["Percentage of Players"].map("{:.2%}".format)

age_demo_count_df

           Total Count Percentage of Players
Age Group
>10                 23                 2.95%
10-14               28                 3.82%
15-19              136                18.58%
20-24              365                44.79%
25-29              101                13.37%
30-34               73                 9.03%
35-39               41                 5.38%
40+                 13                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [82]:
# use group by for age group to get table
age_analysis = purchase_df.groupby(["Age Group"]).agg(['count', np.mean, sum,])["Price"].rename(columns={'count':'Purchase Count', 'mean': 'Average Purchase Price', 'sum':'Total Purchase Value'}) 
age_analysis

           Purchase Count  Average Purchase Price  Total Purchase Value
Age Group
>10                    23                3.353478                 77.13
10-14                  28                2.956429                 82.78
15-19                 136                3.035956                412.89
20-24                 365                3.052219               1114.06
25-29                 101                2.900990                293.00
30-34                  73                2.931507                214.00
35-39                  41                3.601707                147.67
40+                    13                2.941538                 38.24

In [83]:
age_average_DF = purchase_df.groupby(["Age Group","SN"]).agg(sum)[["Price"]]
age_average_DF

                         Price
Age Group SN
>10       Adairialis76     NaN
          Adastirin33      NaN
          Aeda94           NaN
          Aela59           NaN
          Aelaria33        NaN
...                        ...
40+       Yathecal82       NaN
          Yathedeu43       NaN
          Yoishirrala98    NaN
          Zhisrisu83       NaN
          Zontibe81        NaN

[4608 rows x 1 columns]

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [ ]:
Top_spenders = purchase_df.groupby(["SN"]).agg(['count', np.mean, sum,])["Price"].rename(columns={'count':'Purchase Count','mean' : 'Average Purchase Price', 'sum': 'Total Purchase Value'})
Top_spenders

In [ ]:
Sorted_df=Top_spenders.sort_values("Total Purchase Value",ascending=False)
Sorted_df["Average Purchase Price"]=Sorted_df["Average Purchase Price"].map("${0:,.2f}".format)
Sorted_df["Total Purchase Value"]=Sorted_df["Total Purchase Value"].map("${0:,.2f}".format)
Sorted_df.head(5)

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [ ]:
Most_Popular = purchase_df.groupby(["Item ID", "Item Name"]).agg(['count', np.mean, sum,])["Price"].rename(columns={'count':'Purchase Count','mean' : 'Item Price', 'sum': 'Total Purchase Value'})

In [ ]:
# clean up data
Sorted_Popular_df=Most_Popular.sort_values("Purchase Count",ascending=False)
Sorted_Popular_df["Item Price"]=Sorted_Popular_df["Item Price"].map("${0:,.2f}".format)
Sorted_Popular_df["Total Purchase Value"]=Sorted_Popular_df["Total Purchase Value"].map("${0:,.2f}".format)
Sorted_Popular_df.head(5)

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [ ]:
Sorted_Popular_df=Most_Popular.sort_values("Total Purchase Value",ascending=False)
Sorted_Popular_df["Item Price"]=Sorted_Popular_df["Item Price"].map("${0:,.2f}".format)
Sorted_Popular_df["Total Purchase Value"]=Sorted_Popular_df["Total Purchase Value"].map("${0:,.2f}".format)
Sorted_Popular_df.head(5)